Revit 2024 API
ExternalDataInstanceAddedIntoDocumentEventArgs Class
 The event arguments used by the ExternalDataInstanceAddedInto event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class ExternalDataInstanceAddedIntoDocumentEventArgs : RevitAPIPostDocEventArgs
Visual Basic
Public Class ExternalDataInstanceAddedIntoDocumentEventArgs _
	Inherits RevitAPIPostDocEventArgs
Visual C++
public ref class ExternalDataInstanceAddedIntoDocumentEventArgs : public RevitAPIPostDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs
See Also
ExternalDataInstanceAddedIntoDocumentEventArgs Members
Autodesk.Revit.DB.Events Namespace